{
  "main": {
    "name": "Yogesh Singh Malik",
    "occupation": "The React Developer you've been looking for",
    "description": "Bringing ideas to life with performant, scalable web apps with React & Nextjs.",
    "image": "profilepic.jpg",
    "bio": "I'm Yogesh, fondly known as faujiBryant, a React.js Developer based in New Delhi. My formative years were shaped by my father's Army service, instilling in me discipline, commitment, and adaptability. I studied at Army Public Schools across India before earning my B.E. degree in Information Technology from the prestigious Army Institute of Technology, Pune. I have worked with Trendsetters, Vaionex APAC, Indian Oil Corporation Ltd., Tripjack, and various clients through freelancing specializing in React, Next.js, Tailwind CSS, Redux, and UI optimization. I have also represented Pune District Basketball team and South West Delhi teams in senior-level competitions for Basketball, Netball, and Korfball, and have actively volunteered for social causes too. Being a sportsman, I understand the value of team-spirit and is never discouraged by failure but is always eager to learn more every day. I thrive on teamwork, resilience, and continuous learning. I'm looking for a role that aligns with my expertise, offers growth, and values impact - open to both full-time and freelance opportunities. Let's connect to explore how my skills can elevate your team. Together, we'll achieve remarkable results.",
    "contactmessage": "Get in touch with me",
    "email": "ysmworking@gmail.com",
    "phone": "+91 **********",
    "address": {
      "street": "",
      "city": "New Delhi",
      "state": "India",
      "zip": "1100XX"
    },
    "website": "https://codesandbox.io/u/yogeshmalik",
    "resumedownload": "https://drive.google.com/file/d/1wSosLLXQb-r2AtGPWOPQfoMg0VpfkyrD/view",
    "social": [
      {
        "name": "github",
        "url": "https://github.com/Yogeshmalik",
        "className": "fa-brands fa-github"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ysmworking/",
        "className": "fa-brands fa-linkedin"
      },
      {
        "name": "Blog",
        "url": "https://medium.com/@ballerbytes",
        "className": "fa-solid fa-rss"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/thesixftperspective/",
        "className": "fa-brands fa-instagram"
      }
    ]
  },
  "resume": {
    "skillmessage": "SKILLS AND TOOLS I KNOW",

    "work": [
      {
        "company": "Independent Frontend Consultant",
        "logo": "",
        "title": "Senior React + Next.js Developer",
        "years": "Feb 2022 - Present",
        "description": [
          "Delivered end-to-end frontend solutions for startups and SMEs using React, Next.js, and Tailwind CSS, focusing on performance, scalability, and clean architecture. Built responsive dashboards, landing pages, and SaaS platforms with API integrations, authentication, and analytics. Collaborated closely with founders and backend teams to translate business requirements into reliable digital products. Utilized modern development workflows, AI-assisted tools, and best practices to accelerate delivery while maintaining high code quality and long-term maintainability.",
          "* SSYStem PG - Remote - (Gurugram, Haryana, India)",
          "* Novathes GmbH (Kolsetu Inc.) - Remote - (Hamburg, Germany)",
          "* Veerpath Defence Academy - Remote - (New Delhi, India)",
          "* We Code For You - Remote - (New Delhi, India)"
        ]
      },
      {
        "company": "Tripjack Pvt. Ltd.",
        "logo": "/images/tripjack.png",
        "title": "Software Development Engineer (Fixed-Term Contract)",
        "years": "",
        "description": "via Supersourcing Technologies Pvt. Ltd. During this tenure, I was brought in on a fixed-term contract specifically to optimize the performance of their 'Pluto' dashboard. They were facing issues with page load latency on hotel searches, which was affecting B2B conversions. My mission was to identify the bottlenecks and fix them. I implemented aggressive code-splitting and integrated Google Analytics 4 for better observability, achieving a 15% reduction in load times. Once those critical performance benchmarks were met and the system was stabilized, my contract concluded."
      },
      {
        "company": "IndianOil Corporation Ltd.",
        "logo": "/images/iocl.jpg",
        "title": "Software Developer",
        "years": "",
        "description": "via Maxworth Electronic Systems (P) Ltd. During this tenure, this was a digital transformation mandate. IOCL needed to modernize their 'iSmart' reporting portal for senior officers. They brought me in to lead the migration from legacy views to a modern React/Tailwind architecture. Government projects often have very specific delivery milestones; my role was to architect the new frontend, ensure it met internal security protocols, and hand it over for maintenance. I successfully delivered the 'iSmart 2.0' upgrade."
      },
      {
        "company": "Vaionex APAC",
        "logo": "/images/vaionex.webp",
        "title": "Frontend Developer",
        "years": "",
        "description": "During this tenure, I Developed full-stack web applications using Next.JS, React, Tailwind CSS and Notion, including HTML, CSS, JavaScript, Redux, Material UI, Tailwind CSS, Git, VS Code, Google Firebase Firestore Database, Firebase Storage, Firebase hosting and gained practical insights into crafting applications and maintenance of the website."
      },
      {
        "company": "Trendsetters Skill Assessors Pvt. Ltd.",
        "logo": "/images/trendsetters.png",
        "title": "Frontend Developer",
        "years": "",
        "description": "During this tenure, I polished my frontend and backend development skills, including React.js, HTML, CSS, JavaScript, Redux, Material UI, Bootstrap, Enzyme, Jest, Git, SQL, Tableau, Photoshop, VS Code, Google Firebase Firestore Database, Firebase Storage, Firebase hosting and gained practical insights into crafting applications and maintenance of the website. If you know of any job openings in your company or network that may be a good fit for me, please let me know."
      },
      {
        "company": "Capital Business Systems Private Limited and Togedr",
        "title": "BDE",
        "years": "2 Months + 1 Year",
        "description": "Experience working as a Business Development Executive, where I gained expertise in Excel, Business opportunities, Marketing literature, Sales, Revenue, and Invoices. I've also worked in B2B and B2C environment and has proficiency in Tableau and Sales."
      }
    ],
    "projects": [
      {
        "name": "Elba - Communication Platform",
        "company": "Novathes GmbH (Kolsetu Inc.)",
        "description": "Developed a scalable, multi-tenant communication dashboard using AWS Amplify, enabling multiple practices to manage operations with Google Calendar integration. Implemented automated onboarding workflows with AWS Lambda and Amazon Cognito to streamline user setup and reduce administrative effort. Designed secure role-based access control and authentication flows with configurable business hours management. Collaborated closely with cross-functional teams to enhance platform features and optimize n8n-based automation workflows for improved system efficiency."
      },
      {
        "name": "Novathes Business Website",
        "company": "Novathes GmbH (Kolsetu Inc.)",
        "description": "Built a high-performance marketing website using Next.js 15 to showcase company offerings and product features across multiple landing pages. Developed an advanced lead capture system with newsletter, waitlist, and subscription workflows to improve user acquisition. Integrated Zoho CRM with automated email services for real-time lead synchronization and personalized campaigns. Implemented responsive UI using Tailwind CSS and React Hook Form validation to enhance usability and reduce form abandonment rates."
      },
      {
        "name": "Hotels and Pluto Dashboard",
        "company": "Tripjack Pvt. Ltd.",
        "description": "Developed and maintained dashboard features like Hotel Search, Manage Carts, and Manage Amendments. Improved operational efficiency by 30% with streamlined booking and inventory management. Integrated Google Analytics to track key metrics, boosting performance by 15%. Collaborated with teams to enhance hotel management and reporting workflows."
      },
      {
        "name": "iSmart 2.0",
        "company": "Indian Oil Corporation Ltd.",
        "description": "Developed iSmart web portal for senior officers for reports and analytics. Implemented intuitive user interfaces for optimal user experience, focusing on usability & UI. Contributed actively to Agile methodologies and collaboration tools, resulting in a 20% improvement in project workflow."
      },
      {
        "name": "Indian Oil RFC",
        "company": "Indian Oil Corporation Ltd.",
        "description": "Built this project to ease the hierarchy permission process for Indian Oil Officers using Next.js, React, and other modern technologies."
      },
      {
        "name": "BSV-Blockchain",
        "company": "Vaionex Corp.",
        "link": "",
        "description": "Implemented intuitive user interfaces for optimal user experience, focusing on usability & UI. Contributed actively to Agile methodologies and collaboration tools, resulting in a 20% improvement in project workflow. Successfully integrated third-party applications based on project requirements."
      },
      {
        "name": "Relysia - Bitcoin Wallet",
        "company": "Vaionex Corp.",
        "description": "Implemented API integrations, performing CRUD operations securely and efficiently. Resolved issues and debugged the web application, ensuring smooth and error-free operation for end-users. Contributed to the continuous improvement of the product by maintaining and updating the website."
      },
      {
        "name": "AI Forge London - MATRX",
        "company": "Vaionex Corp.",
        "description": "Developed a user-friendly web application for Matrx Group. Built dynamic forms and UI components, actively participating in enhancements."
      },
      {
        "name": "SSYStem PG",
        "description": "Created a web application for a PG. Ensuring user access to the latest information."
      },
      {
        "name": "Kilam GPT",
        "description": "AI-powered chat assistant is here! Start asking questions and explore the power of AI."
      },
      {
        "name": "Kheldhaara",
        "description": "Created a full-stack web application for a Tennis Group. Integrated real-time updates using Firebase's backend-as-a-service, ensuring user access to the latest information."
      },
      {
        "name": "Cricket Winner",
        "description": "Cricket Winner is a cricket match prediction and news website for cricket fanatics seeking access to everything from fantasy tips, sportsbooks, match odds, live scores, cricket news, and videos."
      }
    ],

    "skills": [
      {
        "name": "React.Js",
        "level": "79%"
      },
      {
        "name": "Next.Js",
        "level": "79%"
      },
      {
        "name": "HTML5",
        "level": "90%"
      },
      {
        "name": "CSS3",
        "level": "90%"
      },
      {
        "name": "JavaScript"
      },
      {
        "name": "Bootstrap"
      },
      {
        "name": "Tailwind CSS"
      },
      {
        "name": "Material UI"
      },
      {
        "name": "Tableau"
      },
      {
        "name": "Web Development"
      },
      {
        "name": "Responsive Web Design"
      },
      {
        "name": "Git"
      },
      {
        "name": "VS Code"
      },
      {
        "name": "Jira"
      },
      {
        "name": "Jest"
      },
      {
        "name": "Enzyme"
      },
      {
        "name": "Firebase Storage"
      },
      {
        "name": "Google Firestore Database"
      },
      {
        "name": "Photoshop"
      },
      {
        "name": "AI"
      },
      {
        "name": "AWS"
      }
    ],
    "education": [
      {
        "school": "Army Institute Of Technology, Pune",
        "university": "Savitribai Phule Pune University",
        "degree": "Bachelor of Engineering",
        "major": "Information Technology",
        "description": "Graduated with First Class with Distinction"
      },
      {
        "school": "Army Public School Delhi Cantt",
        "board": "Central Board of Secondary Education - CBSE",
        "degree": "Higher Secondary School",
        "major": "PCM",
        "graduated": "",
        "description": "Physics, Chemistry, Maths"
      }
    ],
    "achievements": [
      {
        "title": "Pune University Basketball Player",
        "location": "Pune, MH",
        "description": "First-ever selection from college since 1994."
      },
      {
        "title": "Delhi Senior State Championships",
        "location": "New Delhi, India",
        "description": "Represented Delhi West zone in Basketball, Netball, and Korfball."
      },
      {
        "title": "AWES Sports Scholarship",
        "location": "India",
        "description": "Selection in Pune District Team."
      },
      {
        "title": "Best Sports Person",
        "location": "India",
        "description": "Overall Performance at Army Institute of Technology."
      },
      {
        "title": "Designed Basketball Jerseys",
        "location": "India",
        "description": "Designed basketball team jerseys for 4 years using Photoshop."
      }
    ],
    "strengths": [
      { "name": "Adaptability", "icon": "fa-solid fa-sync-alt" },
      { "name": "Curious to learn", "icon": "fa-solid fa-lightbulb" },
      { "name": "Team player", "icon": "fa-solid fa-users" },
      { "name": "Hardworking", "icon": "fa-solid fa-briefcase" },
      { "name": "Leadership", "icon": "fa-solid fa-user-tie" },
      { "name": "Discipline", "icon": "fa-solid fa-check-circle" },
      { "name": "Patience", "icon": "fa-solid fa-hourglass-half" },
      { "name": "Communication", "icon": "fa-solid fa-comments" }
    ],
    "interests": [
      { "name": "Basketball", "icon": "fa-solid fa-basketball-ball" },
      { "name": "Photography", "icon": "fa-solid fa-camera" },
      { "name": "Travel", "icon": "fa-solid fa-plane" },
      { "name": "Cycling", "icon": "fa-solid fa-bicycle" },
      { "name": "Music", "icon": "fa-solid fa-music" },
      { "name": "Technology", "icon": "fa-solid fa-microchip" },
      { "name": "Pollution is Complimentary", "icon": "fa-solid fa-leaf" }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Kheldhaara",
        "category": "",
        "image": "kheldhaara.jpg",
        "url": "https://kheldhaara.com"
      },
      {
        "title": "Novathes Business Website",
        "category": "",
        "image": "elba-novathes.jpg",
        "url": "https://novathes.com/"
      },
      {
        "title": "SSYStem PG",
        "category": "",
        "image": "ssys.jpg",
        "url": "https://pg-ssys.vercel.app/"
      },
      {
        "title": "Veerpath Defence Academy",
        "category": "",
        "image": "veerpath.jpg",
        "url": "https://www.veerpath.com/"
      }
    ]
  }
}
